{
  "description": "Сложное микрофронтенд приложение, демонстрирующее возможности Webpack Module Federation",
  "service": "Микрофронтенд архитектура",
  "industry": "Веб-разработка",
  "content": [
    {
      "tag": "p",
      "children": [
        "Starships — это сложное микрофронтенд приложение, демонстрирующее возможности Webpack Module Federation для построения распределенных, масштабируемых фронтенд архитектур. Приложение демонстрирует звездолеты из вселенной Звездных Войн с космическим UI, построенным на React 19.2 и TypeScript 5.5."
      ]
    },
    {
      "tag": "p",
      "children": [
        "Архитектура следует паттерну микрофронтендов, где различные части приложения разрабатываются, собираются и развертываются независимо как отдельные пакеты. Хост-приложение оркестрирует несколько удаленных микрофронтендов, включая домашнюю страницу со списком звездолетов и функцией поиска, а также страницу деталей для информации об отдельных звездолетах."
      ]
    },
    {
      "tag": "p",
      "children": [
        "Проект использует Webpack 5.101 с Module Federation для интеграции удаленных модулей в runtime. Общие пакеты включают API клиент с TypeScript типами, React хуки для получения данных, переиспользуемую библиотеку UI компонентов со Styled Components, общие стили и утилиты, а также централизованную конфигурацию webpack."
      ]
    },
    {
      "tag": "ul",
      "children": [
        {
          "tag": "li",
          "children": [
            "Фронтенд на React 19.2 с TypeScript 5.5"
          ]
        },
        {
          "tag": "li",
          "children": ["Webpack 5.101 с Module Federation"]
        },
        {
          "tag": "li",
          "children": [
            "Styled Components для темизируемого UI"
          ]
        },
        {
          "tag": "li",
          "children": ["React Router для навигации"]
        },
        {
          "tag": "li",
          "children": [
            "Структура монорепозитория с pnpm workspaces"
          ]
        },
        {
          "tag": "li",
          "children": [
            "Hot Module Replacement для разработки"
          ]
        },
        {
          "tag": "li",
          "children": [
            "Типобезопасная библиотека компонентов с генерируемыми типами"
          ]
        },
        {
          "tag": "li",
          "children": [
            "Независимо развертываемые микрофронтенды"
          ]
        }
      ]
    },
    {
      "tag": "p",
      "children": [
        "Процесс сборки поддерживает как режим разработки с HMR, так и production сборки, которые объединяют все микрофронтенды в единую дистрибуцию. Качество кода поддерживается с помощью ESLint 9 и Prettier, а структура проекта организована в apps (хост), pages (микрофронтенд страницы) и packages (общие микрофронтенды)."
      ]
    },
    {
      "tag": "p",
      "children": [
        "Кодовая база состоит на 88.2% из TypeScript, на 9.3% из JavaScript, с полной типобезопасностью во всех микрофронтендах. Каждый микрофронтенд может разрабатываться и развертываться независимо, при этом общие зависимости разделяются через конфигурацию shared scope в Module Federation."
      ]
    }
  ]
}
