{
  "description": "Chrome расширение для управление и быстрого доступа к сохраненным ссылкам",
  "industry": "Браузерные расширения",
  "service": "Менеджер закладок",
  "content": [
    {
      "tag": "p",
      "children": [
        "HomeDash — это Chrome расширение, построенное на React, TypeScript и Vite.js, которое заменяет стандартную страницу новой вкладки Chrome организованной системой управления закладками. Расширение предоставляет структурированный интерфейс для управления закладками с группами и индивидуальной организацией закладок."
      ]
    },
    {
      "tag": "p",
      "children": [
        "Расширение разработано с использованием React с TypeScript для типобезопасности, Vite.js для быстрой разработки и сборки, и CSS Modules с Sass для стилизации. Проект включает комплексное тестирование с Vitest и следует современным практикам разработки с ESLint для качества кода."
      ]
    },
    {
      "tag": "p",
      "children": [
        "Кодовая база на 93.4% состоит из TypeScript с 5.3% SCSS, демонстрируя сильный фокус на типобезопасности и поддерживаемой стилизации. Расширение поддерживает полные CRUD операции для групп закладок и отдельных закладок, с функциональностью перетаскивания для изменения порядка и адаптивным дизайном для всех размеров экранов."
      ]
    },
    {
      "tag": "ul",
      "children": [
        {
          "tag": "li",
          "children": [
            "Фронтенд на React с TypeScript"
          ]
        },
        {
          "tag": "li",
          "children": [
            "Vite.js для инструментов сборки и разработки"
          ]
        },
        {
          "tag": "li",
          "children": [
            "CSS Modules с препроцессором Sass"
          ]
        },
        {
          "tag": "li",
          "children": [
            "Vitest для модульного тестирования"
          ]
        },
        {
          "tag": "li",
          "children": [
            "Chrome Extension Manifest V3"
          ]
        },
        {
          "tag": "li",
          "children": [
            "Полностью адаптивный дизайн"
          ]
        },
        {
          "tag": "li",
          "children": [
            "Перетаскивание закладок для изменения порядка"
          ]
        },
        {
          "tag": "li",
          "children": [
            "Управление группами закладок"
          ]
        },
        {
          "tag": "li",
          "children": [
            "Распространение через Chrome Web Store"
          ]
        }
      ]
    },
    {
      "tag": "p",
      "children": [
        "Проект использует множественные конфигурации Vite для различных частей расширения, включая фоновые скрипты, контент-скрипты и всплывающие страницы. Рабочий процесс разработки включает автоматизированные релизы через GitHub Actions с release-please для управления версиями и генерации changelog."
      ]
    },
    {
      "tag": "p",
      "children": [
        "Архитектура расширения разделяет ответственность с выделенными конфигурациями Vite для фоновых скриптов (vite.background.config.ts), базовой конфигурации (vite.base.config.ts) и специфичных для страниц сборок (vite.page.config.ts), обеспечивая эффективную разработку и оптимизированные production сборки."
      ]
    }
  ]
}
