{
  "description": "Комплексный шаблон новостного веб-сайта",
  "service": "Шаблон новостного веб-сайта",
  "industry": "СМИ",
  "content": [
    {
      "tag": "p",
      "children": [
        "Шаблон новостного веб-сайта — это современная переработка шаблона HotMagazine, построенная на ванильных веб-технологиях. Хотя визуально похож на оригинальный шаблон 2015 года, эта реализация включает значительные архитектурные улучшения и современные CSS-техники для улучшенной адаптивности и производительности."
      ]
    },
    {
      "tag": "p",
      "children": [
        "Проект разработан с использованием HTML (76.5% кодовой базы), SCSS (14.7%), JavaScript (8.5%) и CSS (0.3%) с Webpack для инструментов сборки и Babel для транспиляции JavaScript. Шаблон фокусируется на пользовательских реализациях вместо внешних библиотек, обеспечивая лучший контроль над функциональностью и оптимизацией производительности."
      ]
    },
    {
      "tag": "p",
      "children": [
        "Ключевые улучшения по сравнению с оригинальным шаблоном включают пользовательские реализации каруселей, разработанные с нуля с полной поддержкой настройки и адаптивности, современные CSS-технологии, такие как Flexbox и CSS Grid для полного адаптивного дизайна, и оптимизированный процесс сборки с Webpack для эффективного объединения ресурсов и разделения кода."
      ]
    },
    {
      "tag": "ul",
      "children": [
        {
          "tag": "li",
          "children": [
            "HTML5 семантическая структура разметки"
          ]
        },
        {
          "tag": "li",
          "children": [
            "SCSS для продвинутой препроцессинга CSS"
          ]
        },
        {
          "tag": "li",
          "children": [
            "Vanilla JavaScript для функциональности каруселей"
          ]
        },
        {
          "tag": "li",
          "children": [
            "Webpack с Babel для оптимизации сборки"
          ]
        },
        {
          "tag": "li",
          "children": [
            "Пользовательские реализации каруселей"
          ]
        },
        {
          "tag": "li",
          "children": ["Макеты на Flexbox и CSS Grid"]
        },
        {
          "tag": "li",
          "children": ["Полностью адаптивный дизайн"]
        },
        {
          "tag": "li",
          "children": [
            "Конфигурация PostCSS для обработки CSS"
          ]
        },
        {
          "tag": "li",
          "children": ["Современная CSS архитектура"]
        }
      ]
    },
    {
      "tag": "p",
      "children": [
        "Архитектура шаблона подчеркивает пользовательскую разработку над зависимостями от библиотек, обеспечивая легкую производительность и полный контроль над интерактивными элементами. Все карусели построены с нуля с комплексными опциями настройки и принципами адаптивного дизайна mobile-first."
      ]
    },
    {
      "tag": "p",
      "children": [
        "Рабочий процесс разработки включает конфигурацию Webpack для объединения ресурсов, PostCSS для обработки и оптимизации CSS, и современные функции JavaScript с транспиляцией Babel. Проект служит как функциональным шаблоном новостного веб-сайта, так и демонстрацией современных практик ванильной веб-разработки без зависимостей от внешних фреймворков."
      ]
    }
  ]
}
