{
  "description": "Моя дипломная работа для Санкт-Петербургского государственного университета",
  "service": "Дипломная работа",
  "industry": "Образование",
  "content": [
    {
      "tag": "p",
      "children": [
        "Сайт дипломной работы — это интерактивный презентационный веб-сайт, построенный на Nuxt.js для демонстрации результатов академических исследований в удобном и привлекательном формате. Проект сочетает современные веб-технологии с визуализацией данных для создания аутентичной и визуально впечатляющей презентации результатов дипломной работы."
      ]
    },
    {
      "tag": "p",
      "children": [
        "Веб-сайт разработан с использованием Nuxt.js в качестве основного фреймворка с JavaScript (74.8% кодовой базы), TypeScript (9.7%), Vue компонентами (5.8%), HTML (4.9%) и Stylus (4.8%) для стилизации. Проект интегрирует Reveal.js для создания интерактивных презентаций и Chart.js для визуализации данных, предоставляя комплексную платформу для презентации академического контента."
      ]
    },
    {
      "tag": "p",
      "children": [
        "Основная функциональность включает интерактивную SVG карту Российской Федерации, экономическую панель управления, отображающую данные о потерях в отраслях, и анимированную систему презентаций с яркой функциональностью. Веб-сайт также предоставляет доступ к полному тексту дипломной работы и отзывам в специальном разделе, делая его комплексной академической презентационной платформой."
      ]
    },
    {
      "tag": "ul",
      "children": [
        {
          "tag": "li",
          "children": [
            "Фреймворк Nuxt.js для полнофункциональных приложений"
          ]
        },
        {
          "tag": "li",
          "children": [
            "Reveal.js для интерактивных презентаций"
          ]
        },
        {
          "tag": "li",
          "children": [
            "Chart.js для визуализации данных"
          ]
        },
        {
          "tag": "li",
          "children": [
            "Интерактивная SVG карта Российской Федерации"
          ]
        },
        {
          "tag": "li",
          "children": [
            "Экономическая панель с отраслевыми данными"
          ]
        },
        {
          "tag": "li",
          "children": [
            "Анимированная функциональность презентаций"
          ]
        },
        {
          "tag": "li",
          "children": [
            "Раздел с текстом дипломной работы и отзывами"
          ]
        },
        {
          "tag": "li",
          "children": [
            "Stylus для препроцессинга CSS"
          ]
        },
        {
          "tag": "li",
          "children": [
            "TypeScript для типобезопасности"
          ]
        }
      ]
    },
    {
      "tag": "p",
      "children": [
        "Структура проекта включает выделенные директории для компонентов, композаблов, модулей, данных и статических страниц, демонстрируя хорошо организованную кодовую базу. Веб-сайт использует возможности Nuxt.js для серверного рендеринга, генерации статических сайтов и компонентной архитектуры для обеспечения оптимальной производительности и пользовательского опыта."
      ]
    },
    {
      "tag": "p",
      "children": [
        "Рабочий процесс разработки включает автоматизированное развертывание через GitHub Actions, комплексную организацию проекта с отдельными директориями для различных задач и современные практики разработки с Prettier для форматирования кода и TypeScript для улучшенного опыта разработки. Проект служит как инструментом академической презентации, так и демонстрацией современных возможностей веб-разработки."
      ]
    }
  ]
}
